Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.PrintDrawing Method (Drawing, DPMPrinterAttributes, String)
 Prints the drawing to file using the given printer attributes and name of the output file. The given output file overrides the printer attributes file settings.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool PrintDrawing(
	Drawing drawing,
	DPMPrinterAttributes printAttributes,
	string outputFile
)
Public Function PrintDrawing (
	drawing As Drawing,
	printAttributes As DPMPrinterAttributes,
	outputFile As String
) As Boolean
Parameters
drawing
Type: Tekla.Structures.Drawing.Drawing
The drawing to be printed.
printAttributes
Type: Tekla.Structures.Drawing.DPMPrinterAttributes
The print attributes for the print job.
outputFile
Type: System.String
The print output file name.
Return Value
Type: Boolean
True on success, false if printing fails.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if drawing or printerAttributes is null.
Remarks
If there is an active drawing visible in the drawing editor and it is a different drawing to the specified drawing, the active drawing will be closed.
See Also
Reference
DrawingHandler Class
PrintDrawing Overload
Tekla.Structures.Drawing Namespace